Конфигурация/Documents/ВводОстатковАктивовСтраховыхКомпаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВводОстатковАктивовСтраховыхКомпаний</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиПрочихАктивов</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеОперации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВходящийДокумент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязаннаяКорректировка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьНачальныеОстатки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОстаткиДенежныхСредствНаРасчетныхСчетах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Брокер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчетныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВходящийОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПрочие</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходящийОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОстаткиПрочихАктивов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПрочегоАктива</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыПрочихАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Актив</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубъектПрочегоАктива</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВходящийОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрочиеСумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходящийОстаток</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетныйАктивЕПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеАктивыЕПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыПереводовДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ЗначенияДополнительныхСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхСведений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыЮридическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыЮридическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КраткоеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолноеНаименованиеПоУставу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизационноПравоваяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизационноПравовыеФормы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиОГРН</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TIN</Name>
					<Comment>Taxpayer Identification Number</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтранаРегистрации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРегистрационногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовЮридическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отрасль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отрасли</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособСозданияМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыСозданияМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыЮрФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЮрФизЛиц</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыКредитныхИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКредитныхИнструментов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выданный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полученный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ВводОстатковАктивовСтраховыхКомпаний/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область Универсальные_Механизмы_И_Общее

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;	

	ПриЧтенииСозданииНаСервере();	 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	ОбновитьРеквизитыЗаймов();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
			
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма); 

КонецПроцедуры  

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьПолейЗаголовкаФормы();
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьДоступностьПолейЗаголовкаФормы()
	
	// Блокирование доступа к полям формы при выборе связанной корректировки
	ПолеНеДоступно = ЗначениеЗаполнено(ЭтаФорма.Объект.СвязаннаяКорректировка);
	
	Элементы.СчетДоверительногоУправления.ТолькоПросмотр = ПолеНеДоступно; 
	Элементы.Дата.ТолькоПросмотр = ПолеНеДоступно;
	Элементы.ОснованиеОперации.ТолькоПросмотр = ПолеНеДоступно;	
	Элементы.НадписьФормаВРежимеПереноса.Видимость = ЭтаФорма.Объект.ФормироватьНачальныеОстатки;
	Элементы.СвязаннаяКорректировка.Видимость = НЕ ЭтаФорма.Объект.ФормироватьНачальныеОстатки;
	Элементы.ОстаткиПрочихАктивовЗаполнитьАктивыСОстатками.Доступность = НЕ ПолеНеДоступно;
	Элементы.ОстаткиПрочихАктивов.ИзменятьСоставСтрок = НЕ ПолеНедоступно;         
	Элементы.ОстаткиДенежныхСредствНаРасчетныхСчетах.ИзменятьСоставСтрок = НЕ ПолеНедоступно;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)	
	
	// Займы теперь заводятся отдельно для Заемщика/Даты займа и тд.
	ЗаполнитьЗаймыВОстаткахПрочихАктивов();
	
	// При работе с формой возможно заполнение табличных частей неиспользуемыми данными, 
	// они должны быть исключены при сохранении.
	ИндексСтроки = Объект.ОстаткиДенежныхСредствНаРасчетныхСчетах.Количество() - 1;
	Пока ИндексСтроки >= 0 Цикл
		
		СтрокаДенежныеСредства = Объект.ОстаткиДенежныхСредствНаРасчетныхСчетах[ИндексСтроки];
		
		Если СтрокаДенежныеСредства.Сумма = 0 Тогда
			  Объект.ОстаткиДенежныхСредствНаРасчетныхСчетах.Удалить(ИндексСтроки);
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки - 1;
		
	КонецЦикла;
	
	ИндексСтроки = Объект.ОстаткиПрочихАктивов.Количество() - 1;
	Пока ИндексСтроки >= 0 Цикл
		
		СтрокаПрочийАктив = Объект.ОстаткиПрочихАктивов[ИндексСтроки];
		
		Если СтрокаПрочийАктив.Сумма = 0 Тогда
			  Объект.ОстаткиПрочихАктивов.Удалить(ИндексСтроки);
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки - 1;
		
	КонецЦикла;  
	
	// Слишком много пустых документов сейчас, в дальнейшем нужно доработать.
	// Если нет данных, не нужно сохранять пустой документ
	//Если Объект.ОстаткиДенежныхСредствНаРасчетныхСчетах.Количество() = 0
	//	И    Объект.ОстаткиПрочихАктивов.Количество() = 0  Тогда
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//		"Внимание! В документе отсутствуют движения остатков денежных средств и прочих активов. Документ не может быть сохранен.",
	//			Объект,,, Отказ);
	//	
	//КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область Изменения_Атрибутов_Документа

&НаКлиенте
Процедура УстановитьРежимФормированияНачальныхОстатков() Экспорт
	
	УстановитьРежимФормированияНачальныхОстатковНаСервере()
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРежимФормированияНачальныхОстатковНаСервере()   
	
	Объект.ФормироватьНачальныеОстатки = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	СчетДоверительногоУправленияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СчетДоверительногоУправленияПриИзмененииНаСервере()
	 
	Объект.ОстаткиДенежныхСредствНаРасчетныхСчетах.Очистить();
	Объект.ОстаткиПрочихАктивов.Очистить(); 
	
КонецПроцедуры

&НаКлиенте
Процедура СвязаннаяКорректировкаПриИзменении(Элемент)
	
	УстановитьДоступностьПолейЗаголовкаФормы();	
 	СвязаннаяКорректировкаПриИзмененииНаСервере(ЭтаФорма.Объект.СвязаннаяКорректировка, Ложь);

КонецПроцедуры

&НаСервере
Процедура СвязаннаяКорректировкаПриИзмененииНаСервере(ДокументКорректировкаРегистровСсылка, ОтображатьВсеАктивы)
	
	Если ЗначениеЗаполнено(ЭтаФорма.Объект.СвязаннаяКорректировка) Тогда
		Объект.Дата = ДокументКорректировкаРегистровСсылка.Дата;
		Объект.СчетДоверительногоУправления = ДокументКорректировкаРегистровСсылка.СчетДоверительногоУправления;
		Объект.ОснованиеОперации = Неопределено;
	КонецЕсли;
	// При указании связанной корректировки данные по суммам берутся из нее.
	Объект.ОстаткиДенежныхСредствНаРасчетныхСчетах.Очистить();
	Объект.ОстаткиПрочихАктивов.Очистить();
	
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ДокументОбъект.ЗагрузитьСвязаннуюКорректировкуРегистровНаСервереПрочиеАктивы();
	ДокументОбъект.ЗагрузитьСвязаннуюКорректировкуРегистровНаСервереДенежныеСредства();
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

#КонецОбласти

#Область Изменения_Табличной_Части_ОстаткиДенежныхСредств     

&НаКлиенте
Процедура ОстаткиДенежныхСредствНаРасчетныхСчетахСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОстаткиДенежныхСредствНаРасчетныхСчетах.ТекущиеДанные;
	ТекущиеДанные.ИсходящийОстаток = ТекущиеДанные.ВходящийОстаток + ТекущиеДанные.Сумма + ТекущиеДанные.СуммаПрочие; 
	//ПересчитатьОшибкуВТабличнойЧасти(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура ОстаткиДенежныхСредствНаРасчетныхСчетахИсходящийОстатокПриИзменении(Элемент)
	 	
	ТекущиеДанные = Элементы.ОстаткиДенежныхСредствНаРасчетныхСчетах.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.ИсходящийОстаток - ТекущиеДанные.ВходящийОстаток - ТекущиеДанные.СуммаПрочие;   
	//ПересчитатьОшибкуВТабличнойЧасти(ТекущиеДанные);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПересчитатьОшибкуВТабличнойЧасти(ТекущиеДанные)
	
	 ТекущиеДанные.Ошибка = ТекущиеДанные.ВходящийОстаток + ТекущиеДанные.СуммаПрочие + ТекущиеДанные.Сумма -  ТекущиеДанные.ИсходящийОстаток;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВходящийИсходящийОстаткиНаРасчетномСчете(СтрокаТабличнойЧасти)
	
	СтрокаТабличнойЧасти.ВходящийОстаток = 0;	
	СтрокаТабличнойЧасти.ИсходящийОстаток = 0; 	
	СтрокаТабличнойЧасти.СуммаПрочие = 0;

	ДанныеРасчетногоСчета = ПолучитьОстаткиНаРасчетномСчете(
								СтрокаТабличнойЧасти.РасчетныйСчет);
	
	Если Не ДанныеРасчетногоСчета = Неопределено Тогда  	
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ДанныеРасчетногоСчета);
		СтрокаТабличнойЧасти.ИсходящийОстаток = СтрокаТабличнойЧасти.ВходящийОстаток + СтрокаТабличнойЧасти.Сумма + СтрокаТабличнойЧасти.ПрочиеСумма;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиДенежныхСредствНаРасчетныхСчетахРасчетныйСчетПриИзменении(Элемент)
	
	ТекущаяСтрокаТабличнойЧасти = Элементы.ОстаткиДенежныхСредствНаРасчетныхСчетах.ТекущиеДанные; 	
	ТекущаяСтрокаТабличнойЧасти.Сумма = 0;	
	
	ПолучитьВходящийИсходящийОстаткиНаРасчетномСчете(ТекущаяСтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОстаткиНаРасчетномСчете(РасчетныйСчет)

	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиДенежныхСредствОстаткиИОбороты.Брокер КАК Брокер,
	|	ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения КАК МестоХранения,
	|	ОстаткиДенежныхСредствОстаткиИОбороты.РасчетныйСчет КАК Расчетный_Счет,
	|	ОстаткиДенежныхСредствОстаткиИОбороты.Валюта КАК Валюта,
	|	ОстаткиДенежныхСредствОстаткиИОбороты.СуммаНачальныйОстаток КАК ВходящийОстаток,
	|	ОстаткиДенежныхСредствОстаткиИОбороты.СуммаКонечныйОстаток КАК Исходящий_Остаток,
	|	ОстаткиДенежныхСредствОстаткиИОбороты.СуммаОборот КАК СуммаОборот,
	|	ОстаткиДенежныхСредств.Сумма КАК СуммаДокумент
	|ИЗ
	|	РегистрНакопления.ОстаткиДенежныхСредств.ОстаткиИОбороты(
	|			НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
	|			КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
	|			День,
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И РасчетныйСчет = &РасчетныйСчет) КАК ОстаткиДенежныхСредствОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиДенежныхСредств КАК ОстаткиДенежныхСредств
	|		ПО ОстаткиДенежныхСредствОстаткиИОбороты.РасчетныйСчет = ОстаткиДенежныхСредств.РасчетныйСчет
	|			И ОстаткиДенежныхСредствОстаткиИОбороты.Организация = ОстаткиДенежныхСредств.Организация
	|			И ОстаткиДенежныхСредствОстаткиИОбороты.СчетДоверительногоУправления = ОстаткиДенежныхСредств.СчетДоверительногоУправления
	|			И ОстаткиДенежныхСредствОстаткиИОбороты.Брокер = ОстаткиДенежныхСредств.Брокер
	|			И ОстаткиДенежныхСредствОстаткиИОбороты.Валюта = ОстаткиДенежныхСредств.Валюта
	|			И (ОстаткиДенежныхСредств.Регистратор = &Документ)";
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);                	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Документ", ?(ЗначениеЗаполнено(Объект.СвязаннаяКорректировка), Объект.СвязаннаяКорректировка, Объект.Ссылка));	
	Запрос.УстановитьПараметр("РасчетныйСчет", РасчетныйСчет);
	
	Результат = Запрос.Выполнить().Выгрузить();
	                                                     
	Для Каждого СтрокаРезультат из Результат Цикл
		
		РезультатСтруктура = Новый Структура();
		
		Для Каждого Колонка из Результат.Колонки Цикл
			РезультатСтруктура.Вставить(Колонка.Имя, СтрокаРезультат[Колонка.Имя]);
		КонецЦикла;
		
		РезультатСтруктура.Вставить("СуммаПрочие", СтрокаРезультат.СуммаОборот - СтрокаРезультат.СуммаДокумент);
		
		Возврат РезультатСтруктура;	
		
	КонецЦикла;
	
КонецФункции

#Область Заполнение_табличной_части_ОстаткиНаРасчетныхСчетах_Команда

&НаСервере
Процедура ЗагрузитьНачальныеОстаткиНаРасчетныхСчетахНаСервере()
	
	Если Объект.Проведен Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание! Невозможно заполнить проведенный документ");
		Возврат;

	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СвязаннаяКорректировка) Тогда
		
		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		
		ДокументОбъект.ЗагрузитьСвязаннуюКорректировкуРегистровНаСервереДенежныеСредства();
		
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");

		Возврат;
	
	КонецЕсли;
	// Очистка имеющихся данных
	Объект.ОстаткиДенежныхСредствНаРасчетныхСчетах.Очистить();
	 	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиДенежныхСредствОстаткиИОбороты.Брокер КАК Брокер,
	|	ОстаткиДенежныхСредствОстаткиИОбороты.МестоХранения КАК МестоХранения,
	|	ОстаткиДенежныхСредствОстаткиИОбороты.РасчетныйСчет КАК РасчетныйСчет,
	|	ОстаткиДенежныхСредствОстаткиИОбороты.Валюта КАК Валюта,
	|	ОстаткиДенежныхСредствОстаткиИОбороты.СуммаНачальныйОстаток КАК ВходящийОстаток,
	|	ОстаткиДенежныхСредствОстаткиИОбороты.СуммаОборот КАК СуммаПрочие,
	|	ОстаткиДенежныхСредствОстаткиИОбороты.СуммаКонечныйОстаток КАК ИсходящийОстаток
	|ИЗ
	|	РегистрНакопления.ОстаткиДенежныхСредств.ОстаткиИОбороты(
	|			НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
	|			КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
	|			,
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОстаткиДенежныхСредствОстаткиИОбороты";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Период", Объект.Дата); 	
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);  
	
	ВыборкаОстаткиНаРабочихСчетах = Запрос.Выполнить().Выбрать();
		
	Пока ВыборкаОстаткиНаРабочихСчетах.Следующий() Цикл
		
		НоваяСтрокаРасчетныйСчет = Объект.ОстаткиДенежныхСредствНаРасчетныхСчетах.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаРасчетныйСчет, ВыборкаОстаткиНаРабочихСчетах);
		          
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузитьВходящиеОстаткиНаРасчетныхСчетах(Команда)
	
	ЗагрузитьНачальныеОстаткиНаРасчетныхСчетахНаСервере();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Изменения_Табличной_Части_ОстаткиПрочихАктивов 

&НаКлиенте
Процедура ПолучитьВходящийИсходящийОстаткиПрочихАктивов(СтрокаТабличнойЧасти)
	
	Если Объект.Проведен Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание! Невозможно заполнить проведенный документ");
		Возврат;

	КонецЕсли;
	
	
	СтрокаТабличнойЧасти.ВходящийОстаток = 0;	
	СтрокаТабличнойЧасти.ИсходящийОстаток = 0; 	
	СтрокаТабличнойЧасти.ПрочиеСумма = 0;

	ДанныеПрочегоАктива = ПолучитьОстаткиПрочегоАктива(
								СтрокаТабличнойЧасти.Актив,
								СтрокаТабличнойЧасти.Валюта, 
								СтрокаТабличнойЧасти.СубъектПрочегоАктива);
	
	Если Не ДанныеПрочегоАктива = Неопределено Тогда  	
		ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ДанныеПрочегоАктива);
		СтрокаТабличнойЧасти.ИсходящийОстаток = СтрокаТабличнойЧасти.ВходящийОстаток +  СтрокаТабличнойЧасти.Сумма + СтрокаТабличнойЧасти.ПрочиеСумма;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПрочихАктивовАктивПриИзменении(Элемент)
	
	ТекущаяСтрокаТабличнойЧасти = Элементы.ОстаткиПрочихАктивов.ТекущиеДанные; 	
	ТекущаяСтрокаТабличнойЧасти.Сумма = 0;	
	
	ПолучитьВходящийИсходящийОстаткиПрочихАктивов(ТекущаяСтрокаТабличнойЧасти);
	// Учетный актив пересчитывается при выборе нового актива.
	ТекущаяСтрокаТабличнойЧасти.УчетныйАктивЕПС = ПолучитьУчетныйАктив(ТекущаяСтрокаТабличнойЧасти.Актив);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОстаткиПрочихАктивовСубъектВалютаПрочегоАктиваПриИзменении(Элемент)
	
	ТекущаяСтрокаТабличнойЧасти = Элементы.ОстаткиПрочихАктивов.ТекущиеДанные;
	ПолучитьВходящийИсходящийОстаткиПрочихАктивов(ТекущаяСтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПрочихАктивовСуммаПриИзменении(Элемент)
	 	
	ТекущиеДанные = Элементы.ОстаткиПрочихАктивов.ТекущиеДанные;
	ТекущиеДанные.ИсходящийОстаток = ТекущиеДанные.ВходящийОстаток + ТекущиеДанные.Сумма + ТекущиеДанные.ПрочиеСумма; 
	//ПересчитатьОшибкуВТабличнойЧасти(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПрочихАктивовИсходящийОстатокПриИзменении(Элемент)
		
	ТекущиеДанные = Элементы.ОстаткиПрочихАктивов.ТекущиеДанные;
	ТекущиеДанные.Сумма = ТекущиеДанные.ИсходящийОстаток - ТекущиеДанные.ВходящийОстаток - ТекущиеДанные.ПрочиеСумма;   
	//ПересчитатьОшибкуВТабличнойЧасти(ТекущиеДанные);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстаткиПрочихАктивов(Команда)
	
	Для НомерСтроки = 0 по Объект.ОстаткиПрочихАктивов.Количество() - 1 Цикл
		СтрокаТаблицы = Объект.ОстаткиПрочихАктивов[НомерСтроки];

		ПолучитьВходящийИсходящийОстаткиПрочихАктивов(СтрокаТаблицы); 

	КонецЦикла; 	

КонецПроцедуры 

&НаСервере
Функция ПолучитьУчетныйАктив(ПрочийАктив)
	
	Возврат Документы.ВводОстатковАктивовСтраховыхКомпаний.ОпределитьУчетныйПрочийАктивЕПС(Объект.Дата, Неопределено, ПрочийАктив);
				
КонецФункции  

&НаСервере
Функция ПолучитьОстаткиПрочегоАктива(Актив, Валюта, СубъектПрочегоАктива)
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрочиеАктивы.ВидПрочегоАктива КАК Вид_Прочего_Актива,
	|	ОстаткиПрочихАктивовОстаткиИОбороты.Актив КАК Прочий_Актив,
	|	ОстаткиПрочихАктивовОстаткиИОбороты.Субъект КАК Субъект_Прочего_Актива,
	|	ОстаткиПрочихАктивовОстаткиИОбороты.Валюта КАК Валюта,
	|	ЕСТЬNULL(ОстаткиПрочихАктивовОстаткиИОбороты.СуммаНачальныйОстаток, 0) КАК ВходящийОстаток,
	|	ЕСТЬNULL(ОстаткиПрочихАктивовОстаткиИОбороты.СуммаКонечныйОстаток, 0) КАК Исходящий_Остаток,
	|	ЕСТЬNULL(ОстаткиПрочихАктивов.Сумма, 0) КАК СуммаДокумент,
	|	ЕСТЬNULL(ОстаткиПрочихАктивовОстаткиИОбороты.СуммаОборот, 0) КАК СуммаОборот
	|ИЗ
	|	РегистрНакопления.ОстаткиПрочихАктивов.ОстаткиИОбороты(
	|			НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
	|			КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
	|			День,
	|			,
	|			Организация = &Организация
	|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
	|				И ЕСТЬNULL(Субъект, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) = ЕСТЬNULL(&Субъект, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка))
	|				И Актив = &Актив
	|				И (ЕСТЬNULL(&Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|					ИЛИ Валюта = &Валюта)) КАК ОстаткиПрочихАктивовОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПрочиеАктивы КАК ПрочиеАктивы
	|		ПО ОстаткиПрочихАктивовОстаткиИОбороты.Актив = ПрочиеАктивы.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПрочихАктивов КАК ОстаткиПрочихАктивов
	|		ПО ОстаткиПрочихАктивовОстаткиИОбороты.Актив = ОстаткиПрочихАктивов.Актив
	|			И (ОстаткиПрочихАктивов.СчетДоверительногоУправления = ОстаткиПрочихАктивовОстаткиИОбороты.СчетДоверительногоУправления)
	|			И (ЕСТЬNULL(ОстаткиПрочихАктивов.Субъект, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)) = ЕСТЬNULL(ОстаткиПрочихАктивовОстаткиИОбороты.Субъект, ЗНАЧЕНИЕ(Справочник.ЮрФизЛица.ПустаяСсылка)))
	|			И (ОстаткиПрочихАктивов.Валюта = ОстаткиПрочихАктивовОстаткиИОбороты.Валюта)
	|			И (ОстаткиПрочихАктивов.Регистратор = &Документ)";
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);                	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Документ", ?(ЗначениеЗаполнено(Объект.СвязаннаяКорректировка), Объект.СвязаннаяКорректировка, Объект.Ссылка));	
	Запрос.УстановитьПараметр("Актив", Актив);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Субъект", СубъектПрочегоАктива); 
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРезультат из Результат Цикл
		
		РезультатСтруктура = Новый Структура();
		
		Для Каждого Колонка из Результат.Колонки Цикл
			РезультатСтруктура.Вставить(Колонка.Имя, СтрокаРезультат[Колонка.Имя]);
		КонецЦикла;
		
		РезультатСтруктура.Вставить("ПрочиеСумма", СтрокаРезультат.СуммаОборот - СтрокаРезультат.СуммаДокумент);
		
		Возврат РезультатСтруктура;	
		
	КонецЦикла; 	
	
КонецФункции

#Область Заполнение_табличной_части_ОстаткПрочихАктивов_Команда

&НаСервере
Процедура ЗагрузитьНачальныеОстаткиПрочихАктивовНаСервере()
	
	Если Объект.Проведен Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание! Невозможно заполнить проведенный документ");
		Возврат;

	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СвязаннаяКорректировка) Тогда
		
		ДокументОбъект = РеквизитФормыВЗначение("Объект");
		
		ДокументОбъект.ЗагрузитьСвязаннуюКорректировкуРегистровНаСервереПрочиеАктивы();
		
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");

		Возврат;
	
	КонецЕсли;
	// Очистка имеющихся данных
	Объект.ОстаткиПрочихАктивов.Очистить();
	 	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОборотыДокумента.ВидПрочегоАктива КАК ВидПрочегоАктива,
	|	ОборотыДокумента.Актив КАК Актив,
	|	ОборотыДокумента.СубъектПрочегоАктива КАК СубъектПрочегоАктива,
	|	ОборотыДокумента.Валюта КАК Валюта,
	|	ОборотыДокумента.Сумма КАК Сумма,
	|	ОборотыДокумента.УчетныйАктивЕПС КАК УчетныйАктивЕПС
	|ПОМЕСТИТЬ _ОборотыДокумента
	|ИЗ
	|	&ОборотыДокумента КАК ОборотыДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыПрочихАктивов.Ссылка КАК ВидПрочегоАктива,
	|	ПрочиеАктивы.Ссылка КАК Актив,
	|	ЕСТЬNULL(ОстаткиПрочихАктивовОстаткиИОбороты.Валюта, Организации.ВалютаУчета) КАК Валюта,
	|	ЕСТЬNULL(ОстаткиПрочихАктивовОстаткиИОбороты.СуммаНачальныйОстаток, 0) КАК ВходящийОстаток,
	|	ЕСТЬNULL(ОстаткиПрочихАктивовОстаткиИОбороты.СуммаОборот, 0) КАК СуммаВсего,
	|	ЕСТЬNULL(ОстаткиПрочихАктивовОстаткиИОбороты.СуммаКонечныйОстаток, 0) КАК ИсходящийОстаток,
	|	_ОборотыДокумента.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
	|	ЕСТЬNULL(_ОборотыДокумента.Сумма, 0) КАК СуммаДокумента,
	|	ЕСТЬNULL(ОстаткиПрочихАктивовОстаткиИОбороты.Субъект, _ОборотыДокумента.СубъектПрочегоАктива) КАК СубъектПрочегоАктива
	|ПОМЕСТИТЬ _ОстаткиПрочихАктивов
	|ИЗ
	|	Справочник.ПрочиеАктивы КАК ПрочиеАктивы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыПрочихАктивов КАК ВидыПрочихАктивов
	|		ПО ПрочиеАктивы.ВидПрочегоАктива = ВидыПрочихАктивов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПрочихАктивов.ОстаткиИОбороты(
	|				НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
	|				КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
	|				,
	|				,
	|				Организация = &Организация
	|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОстаткиПрочихАктивовОстаткиИОбороты
	|		ПО ПрочиеАктивы.Ссылка = ОстаткиПрочихАктивовОстаткиИОбороты.Актив
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО (Организации.Ссылка = &Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ _ОборотыДокумента КАК _ОборотыДокумента
	|		ПО (_ОборотыДокумента.Актив = ПрочиеАктивы.Ссылка)
	|ГДЕ
	|	(ОстаткиПрочихАктивовОстаткиИОбороты.СуммаНачальныйОстаток > 0
	|			ИЛИ ОстаткиПрочихАктивовОстаткиИОбороты.СуммаКонечныйОстаток > 0
	|			ИЛИ ЕСТЬNULL(_ОборотыДокумента.Сумма, 0) > 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	_ОстаткиПрочихАктивов.ВидПрочегоАктива КАК ВидПрочегоАктива,
	|	_ОстаткиПрочихАктивов.СубъектПрочегоАктива КАК СубъектПрочегоАктива,
	|	_ОстаткиПрочихАктивов.Актив КАК Актив,
	|	_ОстаткиПрочихАктивов.Валюта КАК Валюта,
	|	_ОстаткиПрочихАктивов.ВходящийОстаток КАК ВходящийОстаток,
	|	_ОстаткиПрочихАктивов.СуммаДокумента КАК Сумма,
	|	_ОстаткиПрочихАктивов.ИсходящийОстаток + _ОстаткиПрочихАктивов.СуммаДокумента КАК ИсходящийОстаток,
	|	_ОстаткиПрочихАктивов.УчетныйАктивЕПС КАК УчетныйАктивЕПС,
	|	_ОстаткиПрочихАктивов.СуммаВсего - _ОстаткиПрочихАктивов.СуммаДокумента КАК ПрочиеСумма
	|ИЗ
	|	_ОстаткиПрочихАктивов КАК _ОстаткиПрочихАктивов";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Период", Объект.Дата); 	
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);  	
	Запрос.УстановитьПараметр("ОборотыДокумента", Объект.ОстаткиПрочихАктивов.Выгрузить()); 
	
	ВыборкаПрочиеАктивы = Запрос.Выполнить().Выбрать();
	 
		
	Пока ВыборкаПрочиеАктивы.Следующий() Цикл
		
		НоваяСтрокаПрочийАктив = Объект.ОстаткиПрочихАктивов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаПрочийАктив, ВыборкаПрочиеАктивы);
		
	 	Если НЕ ЗначениеЗаполнено(НоваяСтрокаПрочийАктив.УчетныйАктивЕПС) Тогда
			НоваяСтрокаПрочийАктив.УчетныйАктивЕПС = 
				Документы.ВводОстатковАктивовСтраховыхКомпаний.ОпределитьУчетныйПрочийАктивЕПС
					(Объект.Дата, ВыборкаПрочиеАктивы.ВидПрочегоАктива, ВыборкаПрочиеАктивы.Актив);
		КонецЕсли;
		          
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗагрузитьВходящиеОстаткиПрочихАктивов(Команда)
	
	ЗагрузитьНачальныеОстаткиПрочихАктивовНаСервере();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Импорт_Займов

&НаСервере
Процедура ИмпортироватьЗаймыИзФайлаExcelНаСервере(ДанныеФайла)
	
	ИмпортируемыеДанные = Новый ТаблицаЗначений();
	ИмпортируемыеДанные.Колонки.Добавить("ИННЗаемщика", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25)));
	ИмпортируемыеДанные.Колонки.Добавить("ОГРНЗаемщика", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25)));
	ИмпортируемыеДанные.Колонки.Добавить("НаименованиеЗаемщика", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(500)));
	ИмпортируемыеДанные.Колонки.Добавить("ДатаВыдачиЗайма", Новый ОписаниеТипов("Дата"));
	ИмпортируемыеДанные.Колонки.Добавить("ДатаПогашенияЗайма", Новый ОписаниеТипов("Дата"));
	ИмпортируемыеДанные.Колонки.Добавить("ПроцентЗайма", Новый ОписаниеТипов("Число"));
	ИмпортируемыеДанные.Колонки.Добавить("КодЗайма", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(50)));
	ИмпортируемыеДанные.Колонки.Добавить("СтоимостьЗайма", Новый ОписаниеТипов("Число"));
	ИмпортируемыеДанные.Колонки.Добавить("ЗаймВСистеме", Новый ОписаниеТипов("СправочникСсылка.ПрочиеАктивы"));
	ИмпортируемыеДанные.Колонки.Добавить("ЗаемщикВСистеме", Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица"));
	ИмпортируемыеДанные.Колонки.Добавить("ВходящийОстаток", Новый ОписаниеТипов("Число"));
	ИмпортируемыеДанные.Колонки.Добавить("ПрочиеСумма", Новый ОписаниеТипов("Число"));
	ИмпортируемыеДанные.Колонки.Добавить("ИсходящийОстаток", Новый ОписаниеТипов("Число"));
	ИмпортируемыеДанные.Колонки.Добавить("ВидПрочегоАктива", Новый ОписаниеТипов("СправочникСсылка.ВидыПрочихАктивов"));
	
	Для Каждого ТекСтрока Из ДанныеФайла.Строки Цикл
		
		НоваяСтрока = ИмпортируемыеДанные.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
	КонецЦикла;
	
	Запрос = Новый Запрос();
	
	// Реквизиты займа
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрочиеАктивы.Ссылка КАК Займ,
		|	УсловияЗаймовСтраховыхКомпанийСрезПоследних.Контрагент КАК Заемщик,
		|	УсловияЗаймовСтраховыхКомпанийСрезПоследних.ДатаПогашения КАК ДатаПогашения,
		|	Займы.ДатаЗаключения КАК ДатаРазмещения,
		|	УсловияЗаймовСтраховыхКомпанийСрезПоследних.Процент КАК Процент,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.ИНН, РеквизитыФизическихЛицСрезПоследних.ИНН) КАК ИНН,
		|	РеквизитыЮридическихЛицСрезПоследних.ОГРН КАК ОГРН,
		|	РеквизитыФизическихЛицСрезПоследних.ЮрФизЛицо.Наименование КАК ЮрФизЛицоНаименование,
		|	ЕСТЬNULL(РеквизитыФизическихЛицСрезПоследних.ЮрФизЛицо.ВидЮрФизЛица, РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо.ВидЮрФизЛица) КАК ЮрФизЛицоВидЮрФизЛица,
		|	РеквизитыФизическихЛицСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицСрезПоследних.Отчество КАК ФИО,
		|	ОстаткиПрочихАктивовОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
		|	ОстаткиПрочихАктивовОстаткиИОбороты.СуммаОборот КАК СуммаОборот,
		|	ОстаткиПрочихАктивовОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
		|	ОстаткиПрочихАктивовОстаткиИОбороты.Валюта КАК Валюта
		|ИЗ
		|	Справочник.ПрочиеАктивы КАК ПрочиеАктивы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведенийЗайм
		|		ПО (ЗначенияДополнительныхСведенийЗайм.Объект = ПрочиеАктивы.Ссылка)
		|			И (ЗначенияДополнительныхСведенийЗайм.Свойство.Ключ = ""РеквизитыЗаймаДляПрочегоАктива"")
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Займы КАК Займы
		|		ПО (ЗначенияДополнительныхСведенийЗайм.Значение = Займы.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|			УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
		|			УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|			УсловияКредитныхИнструментовСрезПоследних.Процент КАК Процент,
		|			УсловияКредитныхИнструментовСрезПоследних.Контрагент КАК Контрагент
		|		ИЗ
		|			(ВЫБРАТЬ
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|			ИЗ
		|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&Период, ДатаНачалаДействияУсловий <= &Период) КАК УсловияКредитныхИнструментовСрезПоследних
		|			ГДЕ
		|				УсловияКредитныхИнструментовСрезПоследних.Действует
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&Период, ДатаНачалаДействияУсловий <= &Период) КАК УсловияКредитныхИнструментовСрезПоследних
		|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияЗаймовСтраховыхКомпанийСрезПоследних
		|		ПО (УсловияЗаймовСтраховыхКомпанийСрезПоследних.КредитныйИнструмент = Займы.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (УсловияЗаймовСтраховыхКомпанийСрезПоследних.Контрагент = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицСрезПоследних
		|		ПО (УсловияЗаймовСтраховыхКомпанийСрезПоследних.Контрагент = РеквизитыФизическихЛицСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПрочихАктивов.ОстаткиИОбороты(
		|				НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
		|				КОНЕЦПЕРИОДА(&Период, ДЕНЬ),
		|				,
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОстаткиПрочихАктивовОстаткиИОбороты
		|		ПО ПрочиеАктивы.Ссылка = ОстаткиПрочихАктивовОстаткиИОбороты.Актив
		|			И (УсловияЗаймовСтраховыхКомпанийСрезПоследних.Контрагент = ОстаткиПрочихАктивовОстаткиИОбороты.Субъект)
		|ГДЕ
		|	ПрочиеАктивы.ВидПрочегоАктива.Родитель = &ВидПрочегоАктива";
	
	Запрос.УстановитьПараметр("Период",                       Объект.Дата);
	Запрос.УстановитьПараметр("Организация",                  Объект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ВидПрочегоАктива",			  Справочники.ВидыПрочихАктивов.Займы); 

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПрочиеАктивы = РезультатЗапроса.Выбрать();
	
	Для Каждого СтрокаИмпортируемыхДанных Из ИмпортируемыеДанные Цикл
		
		СтрокаИмпортируемыхДанных.ВидПрочегоАктива = Справочники.ВидыПрочихАктивов.ЗаймыПредоставленныеДругимОрганизациям;
		
		// Физическое лицо
		Если ВыборкаПрочиеАктивы.НайтиСледующий(Новый Структура("ФИО, ЮрФизЛицоВидЮрФизЛица, ДатаРазмещения, ДатаПогашения",
			СтрокаИмпортируемыхДанных.НаименованиеЗаемщика, Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо, 
			СтрокаИмпортируемыхДанных.ДатаВыдачиЗайма, СтрокаИмпортируемыхДанных.ДатаПогашенияЗайма)) Тогда
			
			СтрокаИмпортируемыхДанных.ЗаймВСистеме = ВыборкаПрочиеАктивы.Займ; 			
			СтрокаИмпортируемыхДанных.ЗаемщикВСистеме = ВыборкаПрочиеАктивы.Заемщик;
			СтрокаИмпортируемыхДанных.ВходящийОстаток = ВыборкаПрочиеАктивы.СуммаНачальныйОстаток;			
			СтрокаИмпортируемыхДанных.ПрочиеСумма = ВыборкаПрочиеАктивы.СуммаОборот;   			
			СтрокаИмпортируемыхДанных.ИсходящийОстаток = ВыборкаПрочиеАктивы.СуммаКонечныйОстаток;	
			СтрокаИмпортируемыхДанных.ВидПрочегоАктива = ВыборкаПрочиеАктивы.Займ.ВидПрочегоАктива;
		КонецЕсли;  
		ВыборкаПрочиеАктивы.Сбросить();

		
		// Юр.лицо
		Если ВыборкаПрочиеАктивы.НайтиСледующий(Новый Структура("ОГРН, ЮрФизЛицоВидЮрФизЛица, ДатаРазмещения, ДатаПогашения",
			СтрокаИмпортируемыхДанных.ОГРНЗаемщика, Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо, 
			СтрокаИмпортируемыхДанных.ДатаВыдачиЗайма, СтрокаИмпортируемыхДанных.ДатаПогашенияЗайма)) Тогда
			
			СтрокаИмпортируемыхДанных.ЗаймВСистеме = ВыборкаПрочиеАктивы.Займ; 			
			СтрокаИмпортируемыхДанных.ЗаемщикВСистеме = ВыборкаПрочиеАктивы.Заемщик;
			СтрокаИмпортируемыхДанных.ВходящийОстаток = ВыборкаПрочиеАктивы.СуммаНачальныйОстаток;			
			СтрокаИмпортируемыхДанных.ПрочиеСумма = ВыборкаПрочиеАктивы.СуммаОборот;   			
			СтрокаИмпортируемыхДанных.ИсходящийОстаток = ВыборкаПрочиеАктивы.СуммаКонечныйОстаток;	
			СтрокаИмпортируемыхДанных.ВидПрочегоАктива = ВыборкаПрочиеАктивы.Займ.ВидПрочегоАктива;

		КонецЕсли; 		
		ВыборкаПрочиеАктивы.Сбросить(); 

	КонецЦикла;

	//Для новых займов
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеЗаемщиков.ИННЗаемщика КАК ИННЗаемщика,
		|	ДанныеЗаемщиков.ОГРНЗаемщика КАК ОГРНЗаемщика,
		|	ДанныеЗаемщиков.НаименованиеЗаемщика КАК НаименованиеЗаемщика,
		|	ДанныеЗаемщиков.ЗаймВСистеме КАК ЗаймВСистеме
		|ПОМЕСТИТЬ _ДанныеЗаемщиков
		|ИЗ
		|	&ДанныеЗаемщиков КАК ДанныеЗаемщиков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДанныеЗаемщиков.ИННЗаемщика КАК ИННЗаемщика,
		|	_ДанныеЗаемщиков.ОГРНЗаемщика КАК ОГРНЗаемщика,
		|	_ДанныеЗаемщиков.НаименованиеЗаемщика КАК НаименованиеЗаемщика,
		|	ЮрФизЛица.Ссылка КАК Заемщик,
		|	ЮрФизЛица.ВидЮрФизЛица КАК ВидЮрФизЛица
		|ИЗ
		|	_ДанныеЗаемщиков КАК _ДанныеЗаемщиков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
		|			ПО РеквизитыФизическихЛицСрезПоследних.ЮрФизЛицо = ЮрФизЛица.Ссылка
		|		ПО (_ДанныеЗаемщиков.НаименованиеЗаемщика = РеквизитыФизическихЛицСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицСрезПоследних.Отчество)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ДанныеЗаемщиков.ИННЗаемщика,
		|	_ДанныеЗаемщиков.ОГРНЗаемщика,
		|	_ДанныеЗаемщиков.НаименованиеЗаемщика,
		|	ЮрФизЛица.Ссылка,
		|	ЮрФизЛица.ВидЮрФизЛица
		|ИЗ
		|	_ДанныеЗаемщиков КАК _ДанныеЗаемщиков
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&Период, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЮрФизЛица КАК ЮрФизЛица
		|			ПО РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо = ЮрФизЛица.Ссылка
		|		ПО _ДанныеЗаемщиков.ОГРНЗаемщика = РеквизитыЮридическихЛицСрезПоследних.ОГРН";
	
	Запрос.УстановитьПараметр("Период",				Объект.Дата);
	Запрос.УстановитьПараметр("Организация",		Объект.Организация);
	Запрос.УстановитьПараметр("ДанныеЗаемщиков",	ИмпортируемыеДанные);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаемщики = РезультатЗапроса.Выбрать();

	Для Каждого СтрокаИмпортируемыхДанных Из ИмпортируемыеДанные Цикл

		Если НЕ ЗначениеЗаполнено( СтрокаИмпортируемыхДанных.ЗаймВСистеме ) Тогда
			// Физическое лицо
			Если ВыборкаЗаемщики.НайтиСледующий(Новый Структура("НаименованиеЗаемщика, ВидЮрФизЛица",
				СтрокаИмпортируемыхДанных.НаименованиеЗаемщика, Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо)) Тогда 				 			
				СтрокаИмпортируемыхДанных.ЗаемщикВСистеме = ВыборкаЗаемщики.Заемщик; 	
			КонецЕсли; 
			ВыборкаЗаемщики.Сбросить();
			//Юр.лицо 			
			Если ВыборкаЗаемщики.НайтиСледующий(Новый Структура("ОГРНЗаемщика, ВидЮрФизЛица",
				СтрокаИмпортируемыхДанных.ОГРНЗаемщика, Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо)) Тогда 				 			
				СтрокаИмпортируемыхДанных.ЗаемщикВСистеме = ВыборкаЗаемщики.Заемщик; 	
			КонецЕсли;  			
			ВыборкаЗаемщики.Сбросить();

			Если НЕ  ЗначениеЗаполнено( СтрокаИмпортируемыхДанных.ЗаемщикВСистеме) Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден заемщик в системе по ОГРН или ФИО. (" + 
					СтрокаИмпортируемыхДанных.НаименованиеЗаемщика   + ")");
					
			КонецЕсли;
			
		КонецЕсли;            
		
	КонецЦикла; 	
	
	Для Каждого СтрокаИмпортируемыхДанных Из ИмпортируемыеДанные Цикл

		Займ = Объект.ОстаткиПрочихАктивов.Добавить(); 		
		Займ.Актив =  СтрокаИмпортируемыхДанных.ЗаймВСистеме;
		Займ.СубъектПрочегоАктива =  СтрокаИмпортируемыхДанных.ЗаемщикВСистеме;
		Займ.Валюта = Объект.Организация.ВалютаУчета;
		ЗаполнитьЗначенияСвойств(Займ, СтрокаИмпортируемыхДанных);
		Если Займ.ВидПрочегоАктива = Справочники.ВидыПрочихАктивов.ЗаймыПредоставленныеДругимОрганизациям Тогда
			Займ.УчетныйАктивЕПС  =     Справочники.УчетныеАктивыЕПС.ПредоставленныеЗаймы;
		Иначе
			Займ.УчетныйАктивЕПС  = Справочники.УчетныеАктивыЕПС.ПрочиеАктивыВнеКлассификации;
			
		КонецЕсли;
		
		Займ.ИсходящийОстаток =  СтрокаИмпортируемыхДанных.СтоимостьЗайма + СтрокаИмпортируемыхДанных.ПрочиеСумма;
		Займ.Сумма = СтрокаИмпортируемыхДанных.СтоимостьЗайма - Займ.ВходящийОстаток - СтрокаИмпортируемыхДанных.ПрочиеСумма;
				      
	КонецЦикла; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ИмпортироватьЗаймыИзФайлаExcel(Команда)
	
	Если Объект.Проведен Тогда          		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание! Невозможно импортировать займы в проведенный документ");
		Возврат; 
	КонецЕсли;
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Предупреждение("Не все обязательные атрибуты заполнены",,"Внимание!")	;
		Возврат;
	КонецЕсли;
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбора.Фильтр = "Файлы EXCEL (*.xls)|*.xls;*.xlsx";
	ДиалогВыбора.Заголовок = "Укажите расположение файла с информацией о займах";

	Если Не ДиалогВыбора.Выбрать() Тогда
		Возврат;
	КонецЕсли;
	
	ИмпортируемыйФайл = ДиалогВыбора.ПолноеИмяФайла;
	 	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмпортируемыйФайл);
		Excel.Sheets(1).Select();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат;
	КонецПопытки;

	НомСтр = 8;
	
	//ТаблицаЗначений = Новый ТаблицаЗначений();
	//ТаблицаЗначений.Колонки.Добавить("ИННЗаемщика", Новый ОписаниеТипов("Строка"));
	//ТаблицаЗначений.Колонки.Добавить("ОГРНЗаемщика", Новый ОписаниеТипов("Строка"));
	//ТаблицаЗначений.Колонки.Добавить("НаименованиеЗаемщика", Новый ОписаниеТипов("Строка"));
	//ТаблицаЗначений.Колонки.Добавить("ДатаВыдачиЗайма", Новый ОписаниеТипов("Дата"));
	//ТаблицаЗначений.Колонки.Добавить("ДатаПогашенияЗайма", Новый ОписаниеТипов("Дата"));
	//ТаблицаЗначений.Колонки.Добавить("ПроцентЗайма", Новый ОписаниеТипов("Строка"));
	//ТаблицаЗначений.Колонки.Добавить("КодЗайма", Новый ОписаниеТипов("Строка"));
	//ТаблицаЗначений.Колонки.Добавить("СтоимостьЗайма", Новый ОписаниеТипов("Число"));
	//ТаблицаЗначений.Колонки.Добавить("ЗаймВСистеме", Новый ОписаниеТипов("СправочникСсылка.ПрочиеАктивы"));
	//ТаблицаЗначений.Колонки.Добавить("ЗаемщикВСистеме", Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица"));
	//ТаблицаЗначений.Колонки.Добавить("ВходящийОстаток", Новый ОписаниеТипов("Число"));
	//ТаблицаЗначений.Колонки.Добавить("ПрочиеСумма", Новый ОписаниеТипов("Число"));
	//ТаблицаЗначений.Колонки.Добавить("ИсходящийОстаток", Новый ОписаниеТипов("Число"));
	//ТаблицаЗначений.Колонки.Добавить("ВидПрочегоАктива", Новый ОписаниеТипов("СправочникСсылка.ВидыПрочихАктивов"));
	
	ДанныеФайла = Новый Структура();
	ДанныеФайла.Вставить("Строки", Новый Массив);
	
	Пока НомСтр < 10000 Цикл 		
		Если Не ЗначениеЗаполнено(Excel.Cells(НомСтр,8).Value) Тогда
			Прервать;
		КонецЕсли;
		
		НоваяСтрока = Новый Структура();
		НоваяСтрока.Вставить("ИННЗаемщика", Excel.Cells(НомСтр, 8).Value);   		
		НоваяСтрока.Вставить("ОГРНЗаемщика", Excel.Cells(НомСтр, 9).Value); 
		НоваяСтрока.Вставить("НаименованиеЗаемщика", Excel.Cells(НомСтр, 10).Value); 
		НоваяСтрока.Вставить("ДатаВыдачиЗайма", РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(Excel.Cells(НомСтр, 12).Value)); 
		НоваяСтрока.Вставить("ДатаПогашенияЗайма", РаботаСоСтрокамиКлиентСервер.ДатаИзСтрокиДДММГГГГ(Excel.Cells(НомСтр, 13).Value)); 
		НоваяСтрока.Вставить("КодЗайма", Excel.Cells(НомСтр, 15).Value);  	
		НоваяСтрока.Вставить("СтоимостьЗайма", Excel.Cells(НомСтр, 27).Value);  
		НоваяСтрока.Вставить("ПроцентЗайма", Excel.Cells(НомСтр, 29).Value);  
		
		ДанныеФайла.Строки.Добавить(НоваяСтрока);
		
		НомСтр = НомСтр + 1;
		
	КонецЦикла;

	Excel.DisplayAlerts = 0;
	Excel.ActiveWorkbook.Close();
	Excel.DisplayAlerts = 1;                  
	
	ИмпортироватьЗаймыИзФайлаExcelНаСервере(ДанныеФайла);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗаймыВОстаткахПрочихАктивов()
	
	// Займы теперь заводятся отдельно для Заемщика/Даты займа и тд.
	Для каждого ПрочийАктив из Объект.ОстаткиПрочихАктивов Цикл
		
		// Прочий актив заводим вручную
		Если НЕ ЗначениеЗаполнено(ПрочийАктив.Актив) И ПрочийАктив.ВидПрочегоАктива.Родитель = Справочники.ВидыПрочихАктивов.Займы 
			И ЗначениеЗаполнено(ПрочийАктив.СубъектПрочегоАктива) И ЗначениеЗаполнено( ПрочийАктив.ДатаВыдачиЗайма ) 
			И ЗначениеЗаполнено(ПрочийАктив.ДатаПогашенияЗайма) Тогда
			
			//Проверить, что займ с подобными реквизитами не существует
			Запрос = Новый Запрос();
			Запрос.Текст =                                   
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ПрочиеАктивы.Ссылка КАК Займ
				|ИЗ
				|	Справочник.ПрочиеАктивы КАК ПрочиеАктивы
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведенийЗайм
				|		ПО (ЗначенияДополнительныхСведенийЗайм.Объект = ПрочиеАктивы.Ссылка)
				|			И (ЗначенияДополнительныхСведенийЗайм.Свойство.Ключ = ""РеквизитыЗаймаДляПрочегоАктива"")
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Займы КАК Займы
				|		ПО (ЗначенияДополнительныхСведенийЗайм.Значение = Займы.Ссылка)
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
				|			УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
				|			УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
				|			УсловияКредитныхИнструментовСрезПоследних.Процент КАК Процент,
				|			УсловияКредитныхИнструментовСрезПоследних.Контрагент КАК Контрагент
				|		ИЗ
				|			(ВЫБРАТЬ
				|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
				|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
				|			ИЗ
				|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
				|						&Период,
				|						ДатаНачалаДействияУсловий <= &Период
				|							И Контрагент = &Заемщик
				|							И ДатаПогашения = &ДатаПогашения) КАК УсловияКредитныхИнструментовСрезПоследних
				|			ГДЕ
				|				УсловияКредитныхИнструментовСрезПоследних.Действует
				|			
				|			СГРУППИРОВАТЬ ПО
				|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
				|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(
				|						&Период,
				|						ДатаНачалаДействияУсловий <= &Период
				|							И Контрагент = &Заемщик
				|							И ДатаПогашения = &ДатаПогашения) КАК УсловияКредитныхИнструментовСрезПоследних
				|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
				|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияЗаймовСтраховыхКомпанийСрезПоследних
				|		ПО (УсловияЗаймовСтраховыхКомпанийСрезПоследних.КредитныйИнструмент = Займы.Ссылка)
				|ГДЕ
				|	Займы.ДатаЗаключения = &ДатаРазмещения";
			
			Запрос.УстановитьПараметр("Период", Объект.Дата);
			Запрос.УстановитьПараметр("Заемщик", ПрочийАктив.СубъектПрочегоАктива); 			
			Запрос.УстановитьПараметр("ДатаПогашения", ПрочийАктив.ДатаПогашенияЗайма);			
			Запрос.УстановитьПараметр("ДатаРазмещения", ПрочийАктив.ДатаВыдачиЗайма);
			
			Результат = Запрос.Выполнить();
			
			Займы = Результат.Выбрать();
			
			Если Займы.Следующий() Тогда
				ПрочийАктив.Актив = Займы.Займ.Ссылка;
			Иначе
				
				НачатьТранзакцию();
					
				Блокировка = Новый БлокировкаДанных;
				
				ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УсловияКредитныхИнструментов");				
				ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗначенияДополнительныхСведений");				
				ЭлементБлокировки = Блокировка.Добавить("Справочник.ПрочиеАктивы");   				
				ЭлементБлокировки = Блокировка.Добавить("Справочник.Займы"); 

 
				Блокировка.Заблокировать();        				
				
				// Добавить займ в справочник прочих активов

				ПрочийАктивЗайм = Справочники.ПрочиеАктивы.СоздатьЭлемент();
				ПрочийАктивЗайм.Наименование = "Займ (" + ПрочийАктив.СубъектПрочегоАктива.Наименование + "); от " + Формат(ПрочийАктив.ДатаВыдачиЗайма,  "ДФ=dd.MM.yyyy");
				ПрочийАктивЗайм.ВидПрочегоАктива = ПрочийАктив.ВидПрочегоАктива;
				ПрочийАктивЗайм.Описание =   ПрочийАктивЗайм.Наименование + "; Срок погашения: " + Формат(ПрочийАктив.ДатаПогашенияЗайма, "ДФ=dd.MM.yyyy")  + 
					"; Процентная ставка: " + ПрочийАктив.ПроцентЗайма; 				
				ПрочийАктивЗайм.Записать(); 
				
				// Добавить прокси-займ в справочник займов
				
				СправочникЗайм = Справочники.Займы.СоздатьЭлемент();
				СправочникЗайм.Организация = Объект.Организация;
				СправочникЗайм.Наименование = ПрочийАктивЗайм.Наименование;
				СправочникЗайм.Валюта = Объект.Организация.ВалютаУчета;
				СправочникЗайм.ДатаЗаключения = ПрочийАктив.ДатаВыдачиЗайма;
				СправочникЗайм.ВидКредитногоИнструмента = Перечисления.ВидыКредитныхИнструментов.Выданный;
				СправочникЗайм.Записать();
				
				// Добавить ссылку на прокси-займ в дополнительные сведения к прочему объекту
				
				Свойство = ПланыВидовХарактеристик.ДополнительныеСведения.НайтиПоРеквизиту("Ключ", "РеквизитыЗаймаДляПрочегоАктива");
				Если ЗначениеЗаполнено(Свойство) Тогда
					Запись = РегистрыСведений.ЗначенияДополнительныхСведений.СоздатьМенеджерЗаписи();
					Запись.Объект = ПрочийАктивЗайм.Ссылка;
					Запись.Свойство = Свойство;
					Запись.Значение = СправочникЗайм.Ссылка;
					Запись.Записать();		
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдено дополнительное свойство ""РеквизитыЗаймаДляПрочегоАктива""");
					Возврат;	
				КонецЕсли; 

				// Регистрация реквизитов нового займа
				
				Запись = РегистрыСведений.УсловияКредитныхИнструментов.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, Новый Структура("КредитныйИнструмент, Процент, ДатаПогашения, Контрагент, УчетныйАктив, Действует",
					СправочникЗайм.Ссылка, ПрочийАктив.ПроцентЗайма, ПрочийАктив.ДатаПогашенияЗайма, 
						ПрочийАктив.СубъектПрочегоАктива, ПрочийАктив.УчетныйАктивЕПС, Истина));
				Запись.Период = Объект.Дата;
				Запись.ДатаНачалаДействияУсловий = Объект.Дата;
				Запись.Записать();
				
				ЗафиксироватьТранзакцию();
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Добавлен займ в справочник прочих активов: " + ПрочийАктивЗайм.Описание);
				
				ПрочийАктив.Актив = ПрочийАктивЗайм.Ссылка;

		 
			КонецЕСли;
			
		КонецЕсли;
		
	КонецЦикла;

	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыЗаймов()
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрочиеАктивы.Ссылка КАК ПрочийАктив,
		|	Займы.ДатаЗаключения КАК ДатаВыдачиЗайма,
		|	УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашенияЗайма,
		|	УсловияКредитныхИнструментовСрезПоследних.Процент КАК ПроцентЗайма
		|ИЗ
		|	Документ.ВводОстатковАктивовСтраховыхКомпаний.ОстаткиПрочихАктивов КАК ВводОстатковАктивовСтраховыхКомпанийОстаткиПрочихАктивов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрочиеАктивы КАК ПрочиеАктивы
		|		ПО ВводОстатковАктивовСтраховыхКомпанийОстаткиПрочихАктивов.Актив = ПрочиеАктивы.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ПО (ПрочиеАктивы.Ссылка = ЗначенияДополнительныхСведений.Объект)
		|			И (ЗначенияДополнительныхСведений.Свойство.Ключ = ""РеквизитыЗаймаДляПрочегоАктива"")
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Займы КАК Займы
		|		ПО (ЗначенияДополнительныхСведений.Значение = Займы.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|			УсловияКредитныхИнструментовСрезПоследних.ДатаПогашения КАК ДатаПогашения,
		|			УсловияКредитныхИнструментовСрезПоследних.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|			УсловияКредитныхИнструментовСрезПоследних.Процент КАК Процент,
		|			УсловияКредитныхИнструментовСрезПоследних.Контрагент КАК Контрагент
		|		ИЗ
		|			(ВЫБРАТЬ
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент КАК КредитныйИнструмент,
		|				МАКСИМУМ(УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК ДатаНачалаДействияУсловий
		|			ИЗ
		|				РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&Период, ДатаНачалаДействияУсловий <= &Период) КАК УсловияКредитныхИнструментовСрезПоследних
		|			ГДЕ
		|				УсловияКредитныхИнструментовСрезПоследних.Действует
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент) КАК АктуальныеДатыНачалаДействия
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияКредитныхИнструментов.СрезПоследних(&Период, ДатаНачалаДействияУсловий <= &Период) КАК УсловияКредитныхИнструментовСрезПоследних
		|				ПО АктуальныеДатыНачалаДействия.КредитныйИнструмент = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент
		|					И АктуальныеДатыНачалаДействия.ДатаНачалаДействияУсловий = УсловияКредитныхИнструментовСрезПоследних.ДатаНачалаДействияУсловий) КАК УсловияКредитныхИнструментовСрезПоследних
		|		ПО (Займы.Ссылка = УсловияКредитныхИнструментовСрезПоследних.КредитныйИнструмент)
		|ГДЕ
		|	ВводОстатковАктивовСтраховыхКомпанийОстаткиПрочихАктивов.Ссылка = &ДокументВводОстатковПрочихАктивов";
		
	Запрос.УстановитьПараметр("ДокументВводОстатковПрочихАктивов", Объект.Ссылка);  	
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	
	РеквизитыЗаймов = Запрос.Выполнить().Выбрать();
	
	Для Каждого ПрочийАктив Из ЭтаФорма.Объект.ОстаткиПрочихАктивов Цикл
		
        Если РеквизитыЗаймов.НайтиСледующий(ПрочийАктив.Актив, "ПрочийАктив") Тогда
			
			ЗаполнитьЗначенияСвойств( ПрочийАктив, РеквизитыЗаймов );
			
		КонецЕсли;
		
    КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
    ПараметрыОтбора = Новый Структура
		("ФильтрПоСчетуДоверительногоУправления, ФильтрПоОрганизации, ФильтрПоДатеОперации", 
			Объект.СчетДоверительногоУправления, Объект.Организация, Объект.Дата);
    ОткрытьФорму("Документ.ВходящийДокумент.Форма.ФормаВыбораДатаСчетДУ", ПараметрыОтбора, Элемент);
	

КонецПроцедуры


#КонецОбласти
